En este apartado hablaremos de aspectos básicos de los routers, aspectos que se deben cumplir para que estos dispositivos cumplan su función primaria que es enrutar.

Requisitos que debe de cumplir para su función primaria:

- **Contar con enlace activo**
Es decir que el enlace que se forma entre el router y el otro dispositivo este activo y para que este enlace este activo las interfaces que lo componen deben de estar encendidas.

![[Pasted image 20221219184514.png]]

Por ejemplo si el enlace de un router esta encendido pero del lado de router al que se conecta permanece apagado, esta conexión nunca se activara.

![[Pasted image 20221219185327.png]]

Así que debemos encender ambas interfaces para tener un enlace activo.

- **Interfaces con IP en la misma red** 
Esto hace referencia a que cada router cuente con una dirección ip y además esta dirección ip debe estar en la misma red que la dirección ip de la interfaz del otro extremo del enlace.

Una vez este el enlace, se le asigno una ip a la interfaz:
IP: 192.168.10.1
255.255.255.252

y la interfaz del otro extremo del enlace:
IP: 192.168.110.5
255.255.255.252

*Este enlace no se formara exitosamente por que las interfaces que forman dicho enlace no se encuentran en la misma red.*

![[Pasted image 20221219190252.png]]

---

## Ejercicio
En este caso tendremos 2 redes en las cuales vamos a unir atreves de un enlace del *router A al B*.

![[Pasted image 20221219190559.png]]

Primero debemos identificar las interfaces que se utilizaran en los routers, por un lado tenemos el *router A* donde tendremos 2 interfaces:

- **G0/0/0**
Esta interfaz se utilizara para conexión a la red: *10.10.10.0/24* por medio del *switch* X.
- **Gig0/0/1**
Esta interfaz se utilizara para la conexión al *router B*.

### Activar el enlace
Ahora debemos de cumplir con el primer requisito, para esto activaremos el enlace con la CLI del router en el *Packet Tracer*.

#### Router A
---

```
//Router A

Router> ENABLE
Router# CONFIGURE TERMINAL
Router(config)# INTERFACE
Router(config)# CONFIGURE G0/0/0 //entramos a la configuracion de la interfaz
Router(config-if)# NO SHUTDOWN //activamos la interfaz
```

![[Pasted image 20221219192002.png]]

Con esto ya tendremos la* interfaz del G0/0/0* que conectara a nuestro *switch*, ahora aprovechando que estamos dentro de la configuración de las interfaces, asignaremos una ip al *router A* que este dentro de su red, es decir *10.10.10.0/24*

```
//Retomamos la consola con la interfaz g0/0/0
Router(config-if)# IP ADDRESS 10.10.10.254 255.255.255.0
```

Despues activaremos la *interfaz G0/0/1*, que corresponde a la conexión al otro *router B*

```
//Router A

Router(config-if)# EXIT //retomamos la consola, salimos de la Interfaz G0/0/0
Router(config)# INTERFACE
Router(config)# CONFIGURE G0/0/1 //entramos a la configuracion de la interfaz
Router(config-if)# NO SHUTDOWN //activamos la interfaz
```

Ahora signaremos una dirección ip a la interfaz, pero ¿Qué dirección debe de aginarle?
*Esto dependerá de las características de la red*, esto generalmente es facilitado por la empresa, pero en este caso no se le asignara un ip dentro del rango de la otra red es decir de la red *192.168.1.0/24* por que esta no esta dentro del enlace que pretendemos formar.

Entonces tendremos otra red para formar dicho enlace, es decir *172.16.1.0/30*
Así que la ip de la *interfaz G0/0/1* del *router A* tendrá la ip *172.16.1.1*


```
//Retomamos la consola con la interfaz g0/0/1
Router(config-if)# IP ADDRESS 172.16.1.1 255.255.255.0
```

#### Router B
---

Ahora pasaremos con el *router b*, configuraremos la interfaz *g0/0/0* que ira hacia el *switch*.

```
//Router B

Router> ENABLE
Router# CONFIGURE TERMINAL
Router(config)# INTERFACE
Router(config)# CONFIGURE G0/0/0 //entramos a la configuracion de la interfaz
Router(config-if)# NO SHUTDOWN //activamos la interfaz
```

Ahora a esta misma interfaz le asignaremos una ip que este *dentro del rango de su red*.

```
//Retomamos la consola con la interfaz g0/0/0
Router(config-if)# IP ADDRESS 192.168.1.254 255.255.255.0
```

Despues configuramos la otra interfaz de red, es decir la *g0/0/1* que creara el enlace con el *router a*.

```
//Router B

Router(config-if)# EXIT //retomamos la consola, salimos de la Interfaz G0/0/0
Router(config)# INTERFACE
Router(config)# CONFIGURE G0/0/1 //entramos a la configuracion de la interfaz
Router(config-if)# NO SHUTDOWN //activamos la interfaz
```

Y ah esta interfaz de red le asignaremos una ip que este dentro de nuestra nueva red para la el enlace, es decir de la 172.16.1.0/30

```
//Retomamos la consola con la interfaz g0/0/1
Router(config-if)# IP ADDRESS 172.16.1.2 255.255.255.0
```

Y esto es todo ya contamos con los requisitos para que un router pueda enrutar.

![[Pasted image 20221219205209.png]]

Bien ahora verificaremos que hemos aplicado bien estos requisitos de lo contrario debemos solucionarlos, pasemos con la verificación.

---
## Verificación 
Para esto veremos algunos comandos que nos mostraran los estados que tiene la interfaz de red y corroborar que se encuentran funcionando correctamente.

Ahora estos comando los ejecutaremos de forma privilegiada en router.

### Show ip interface brief

Este nos permite visualizar rápidamente las ips asignadas en las interfaces y el estado de las interfaces de router. 

```
Router> enable
Router# show ip interface brief
```

En el caso de ser un router de cisco solo podremos ver una linea de informacion por cada interfaz de red. Veremos algo similar a esto:

![[Pasted image 20221219224254.png]]

Donde podemos observar la ip que tiene la interfaz, para verificar que el enlace este activo, debemos de observar las dos columnas de *Status*, *Protocol* estas deben de tener como valor *up*.

![[Pasted image 20221219225256.png]]

Ahora si a pesar de que se encuentra bien estas configuración y la signacion de ip, y *realizamos un ping a un host de la red*, pero el nos menciona que el host es inaccesible, estas interfaces deben de inspeccionarse con mas profundidad para dar con el problema.

### Show interfaces
Al ejecutar este comando se nos listara todas las interfaces de forma completa del router.

```
Router# show interfaces
```

Respecto la informacion devuelta es demasiada, pero por la finalidad que tenemos *solo nos interesa lo que configuramos de las interfaces*. Como los estados de las interfaces:

![[Pasted image 20221219225751.png]]

Cualquier otra combinatoria que sea diferente de up-up, esta presenta que el enlace no esta activo. La segunda informacion que debemos de considerar se la dirección de la interfaz:

![[Pasted image 20221219230036.png]]

Ahora esta también nos muestra la mascara de red que se le asigno.

### Show protocols
Si bien podemos distraernos con la informacion que nos resulta el anterior comando, podemos utilizar el comando:

```
Router# show protocols
```

El cual nos lista la informacion que es relevante para nosotros, en este caso, será la ip-address y mascara de red.

![[Pasted image 20221219230919.png]]

Si por alguna razón encontramos alguna incongruencia, solo será cuestión de repetir los [[2. Routers#Ejercicio|pasos anteriores]], pero con esta vez con mas cuidado para evitar errores nuevamente
